# Dependencies from install-zsh.sh
brew "ast-grep"
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fx" # JSON viewer
brew "git"
brew "git-delta"
brew "htop"
brew "jq" # JSON processor
brew "pyenv"
brew "rnr" # Rename multiple files
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
brew "umputun/apps/revdiff"
brew "vim"
brew "zx"

# Keep homebrew up to date
brew "terminal-notifier"

# NerdFonts
cask "font-meslo-lg-nerd-font"

# UI Programs
cask "agentsview"
cask "anki"
cask "brave-browser"
cask "brave-browser@beta"
cask "bitwarden"
brew "bitwarden-cli"
cask "boop"
cask "chromedriver"
cask "claude-code"
cask "cursor"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "firefox"
cask "ghostty"
cask "maestral"
cask "obsidian"
cask "shottr"
cask "slack"
cask "sonos"
cask "spotify"
cask "tunnelblick"
cask "vlc"
cask "zoom"
